#+BEGIN: clocktable :maxlevel 2 :scope file
Clock summary at [2016-04-14 Thu 09:48]

| Headline                                    |   Time |      |
|---------------------------------------------+--------+------|
| *Total time*                                | *4:27* |      |
|---------------------------------------------+--------+------|
| Brose-Orga-Tasks & Brose allgemein          |   2:37 |      |
| \__ APPT Abteilungsrunde<2016-04-11 Mon>    |        | 1:04 |
| \__ APPT SAP-Basis-Runde<2016-04-11 Mon>    |        | 1:17 |
| \__ APPT Telefonat mit Oracle               |        | 0:16 |
| privates                                    |   0:04 |      |
| \__ TODO Incident-Bearbeitung               |        | 0:04 |
| Brose Oracle-NON-SAP                        |   0:57 |      |
| \__ APPT Absprache mit Huemmno              |        | 0:01 |
| \__ Incidents                               |        | 0:08 |
| \__ TODO Systemcopy Torquenet               |        | 0:33 |
| \__ TODO Check error messages ocobrmq       |        | 0:15 |
| Brose Oracle-VM                             |   0:44 |      |
| \__ TODO Aufbau Oracle-VM Bamberg           |        | 0:42 |
| \__ TODO Check OVM-Manager with multiple... |        | 0:02 |
| Brose Netbackup                             |   0:05 |      |
| \__ Probleme beim Restore/Duplicate von...  |        | 0:05 |
#+END:


* Brose-Orga-Tasks & Brose allgemein 

** APPT Abteilungsrunde<2016-04-11 Mon>
   CLOCK: [2016-04-11 Mon 10:56]--[2016-04-11 Mon 12:00] =>  1:04
** APPT SAP-Basis-Runde<2016-04-11 Mon>
   CLOCK: [2016-04-11 Mon 14:00]--[2016-04-11 Mon 15:17] =>  1:17

Notizen:
Kollegen aus Ostrava ab naechste Woche, 1. Woche Brose-Termine
ab Mai Michal Bereitschaft!
Bereitschaft-Wunschkonzert in RT-Runde im JUni

POP im Cloudcontrol auf Prod gesetzt! vorher SAP-CRIT
EBP evtl. auch
HRP produktiv

** APPT Telefonat mit Oracle
   CLOCK: [2016-04-13 Wed 10:31]--[2016-04-13 Wed 10:47] =>  0:16

** Monitoring

*** DONE Blackout setzen fuer detu0016
    CLOCK: [2016-04-14 Thu 09:53]--[2016-04-14 Thu 09:58] =>  0:05


** IET
*** WAITING FOR CIs Oracle-VM
    CLOCK: [2016-04-14 Thu 10:13]--[2016-04-14 Thu 10:24] =>  0:11

* privates

** TODO Incident-Bearbeitung
*** 10492658
*** 10493127  
   CLOCK: [2016-04-11 Mon 09:53]--[2016-04-11 Mon 09:57] =>  0:04
** TODO Zeiterfassung CAT2
   
** TODO Lebensversicherung

* Brose Oracle-NON-SAP

** APPT Absprache mit Huemmno
   CLOCK: [2016-04-12 Tue 09:43]--[2016-04-12 Tue 09:44] =>  0:01
** Incidents

*** 100% core dump odceccp, 10493758  
    CLOCK: [2016-04-12 Tue 09:14]--[2016-04-12 Tue 09:19] =>  0:05
    CLOCK: [2016-04-12 Tue 09:12]--[2016-04-12 Tue 09:14] =>  0:02

*** ocobmit Ora-600
    CLOCK: [2016-04-13 Wed 10:14]--[2016-04-13 Wed 10:15] =>  0:01
** TODO Systemcopy Torquenet
   CLOCK: [2016-04-11 Mon 16:12]--[2016-04-11 Mon 16:28] =>  0:16
   CLOCK: [2016-04-11 Mon 15:38]--[2016-04-11 Mon 15:45] =>  0:07
   CLOCK: [2016-04-11 Mon 10:04]--[2016-04-11 Mon 10:14] =>  0:10
*** DONE new bronze-LUN requested by Storage-Team
*** DONE BRONZE-Lun anbinden, Storage auf PDT vergroessern
 
*** WAITING FOR RMAN-Duplicate
*** TODO Storage hinterher konsolidieren, Tablespaces verkleinern und auf andere Platten schieben
*** INPROGRESS export Quartalsdump
    
** TODO Check error messages ocobrmq
   CLOCK: [2016-04-11 Mon 15:45]--[2016-04-11 Mon 15:55] =>  0:10
Database restarted, potentially RMAN-Backup orphaned session

*** meldet I/O Error - Ursache unklar
   CLOCK: [2016-04-11 Mon 09:16]--[2016-04-11 Mon 09:21] =>  0:05
** TODO Torquenet wieder auf HDD verlagern
aus politischen Gruenden will Bernhard das nicht auf SSD haben, Termin mit Storage Leuten und Manfred Klein wegen Archivierung 

** TODO new NON-SAP Oracle-DB - odcejitp@
** TODO Oracle-Upgrade 11.2.0.4

*** DBs:
- [ ] RMT,RMS,RMP
- [ ] PDB,PDT
- [ ] WBT
- [ ] XPC
- [ ] SMP
- [ ] BPH
- [ ] FPH
- [ ] VPH
- [ ] odceoid
- [ ] odceoit
- [ ] oelmzp
- [ ] ZPK
- [ ] ZPW
- [ ] PDBMAR
- [ ] PDBKOP
- [ ] PDBMEE
- [ ] PDP
- [ ] ORASTMZPP
- [ ] ORAMEEZPP

** WAITING FOR owuezp@wueu0106 - Migration auf Oracle-VM
am 12.04. nach Downtime gefragt
** TODO odceedit@dceu3014 (Application-CI linken)
** TODO ssh-key Management
*** TODO nochmal pruefen, ssh-Files einsammeln
*** TODO Keys von brudnmi,burgsi,mahajga verteilen
*** TODO key von ruffdi und externen entfernen
*** TODO ssh-key-managment?

** TORQUENET

*** TODO check size of LOBs and shrink
TEST SYS@PDT>select segment_name from dba_lobs where table_name='GRAPHICS_DATA' and column_name='AD_VALUES1' and owner='TORQUENET';

SEGMENT_NAME
------------------------------
SYS_LOB0000018175C00007$$

TEST SYS@PDT>select bytes/1024/1024/1024 GB
  2  from dba_segments
  3  where segment_name='SYS_LOB0000018175C00007$$';

        GB
----------
593.448425

TEST SYS@PDT>select sum(dbms_lob.getlength(AD_VALUES1)) from TORQUENET.GRAPHICS_DATA;

TEST SYS@PDT>select sum(dbms_lob.getlength(AD_VALUES1)) from TORQUENET.GRAPHICS_DATA;

SUM(DBMS_LOB.GETLENGTH(AD_VALUES1))
-----------------------------------
                         1.6020E+11

160200000000 bytes
152778

= 149 GB!


alter table HS_ECA.PS_TXN modify lob (CONTENT) (deallocate unused);

 

Table altered.

 

alter table HS_ECA.PS_TXN modify lob (CONTENT) (freepools 1);
alter table HS_ECA.PS_TXN modify lob (CONTENT) (shrink space cascade);
alter table HS_ECA.PS_TXN modify lob (CONTENT) (pctversion 0);
alter table HS_ECA.PS_TXN modify lob (CONTENT) (retention);

Alertlog shows "LOB Freelists need to be dropped. This may take some time."

* Meetings
** Abstimmung P01 DB-Aktionen, Erich Eichhorn
   SCHEDULED: <2016-04-15 Fri>


* Cloudcontrol 13c
** DONE Download Cloudcontrol 13c Software for Linux
** DONE Copy Software to cobu2113
   
** TODO Setup & Install
* Brose Oracle-VM
** TODO Clustertest und Doku Oracle-VM

*** DONE Test-VM auf OVM DCE migrieren
Maintenance-Mode fuer dceu3036 gesetzt bis Mittwoch!
*** CHECKLIST OVM Move VM to DCE
    - [X] set Maintenance Mode in SCOM and Cloudcontrol
    - [X] Stop VM (einen hoeher einordnen)
    - [X] move VM from Cluster to unassigned VMs
    - [X] Clone from NFS-StageDisk to DCE using Clone-Customizer
	- [X] Clone to NFS-StageDisk using Clone-[X]Customizer for NFS
[X] Clone to NFS-StageDisk using Clone-[X]Customizer for NFS

** TODO Aufbau Oracle-VM Bamberg
   CLOCK: [2016-04-11 Mon 13:16]--[2016-04-11 Mon 13:58] =>  0:42

** TODO Upgrade Oracle-VM BAM
** Oracle VM 3.4
*** TODO reading Upgrade Documentation
*** TODO reading Live-Migration-Date
    CLOCK: [2016-04-14 Thu 14:16]--[2016-04-14 Thu 14:32] =>  0:16
** TODO Upgrade Oracle-VM Manager to 3.4
** TODO Upgrade Oracle-VM Servers to 3.4
** DONE Upgrade OVM Environment to latest OVM 3.3
   CLOCK: [2016-04-14 Thu 11:14]--[2016-04-14 Thu 11:23] =>  0:09
*** DONE Upgrade dcev2117
*** DONE Upgrade dcev1117
   CLOCK: [2016-04-14 Thu 10:26]--[2016-04-14 Thu 11:05] =>  0:39

** DONE Check OVM-Manager with multiple Users connected
   CLOCK: [2016-04-12 Tue 09:27]--[2016-04-12 Tue 09:29] =>  0:02
Sascha sagt das ist gefaehrlich, versuch zu reproduzieren
kann leider den Fehler nicht reproduzieren...


* Brose Netbackup
** Probleme beim Restore/Duplicate von PDB auf PDT
   CLOCK: [2016-04-12 Tue 09:04]--[2016-04-12 Tue 09:09] =>  0:05
Policy Restore Error
lag an Disk Full auf dceu3010

#+BEGIN: clocktable :maxlevel 2 :scope subtree
Clock summary at [2016-04-11 Mon 12:17]

| Headline                                   | Time   |      |
|--------------------------------------------+--------+------|
| *Total time*                               | *0:34* |      |
|--------------------------------------------+--------+------|
| Brose Oracle-SAP                           | 0:34   |      |
| \__ TODO brtools-Jobs BBC                  |        | 0:23 |
| \__ TODO check LDAP with Andre, POD new... |        | 0:03 |
| \__ TODO Tablespace HRP critical, warum... |        | 0:08 |
#+END:



* Brose Oracle-SAP
  CLOCK: [2016-04-14 Thu 11:06]--[2016-04-14 Thu 11:12] =>  0:06
** TODO Planung Change Dataguard ADP

** TODO brtools-Jobs HRQB schlagen fehl wegen fehlender License
** TODO brtools SAP
   CLOCK: [2016-04-14 Thu 14:33]--[2016-04-14 Thu 14:36] =>  0:03

*** remaining systems
- [ ] BOD
- [ ] BOP
- [ ] K02
- [ ] P01
- [X] BWT
** DONE Check db_recovery_file_dest EWP
Parameter erhoeht auf 150 GB
** TODO Dataguard Failover and SAP (Client timeouts, reconnects)
** TODO new SAP-Oracle-Server sappopdbp
   - [ ] Initscripts
   - [ ] Device-Takeover/CI
   - [ ] RMAN-Maintenance

** TODO Wallets for Dataguard-Observers
   - [ ] SCP
   - [ ] ADP
   - [ ] BOP
   - [ ] others?



* INBOX
tcp.nodelay P01 am 24.04. nicht vergessen
mlid745qgit
Git-Repo for org-mode, geht mit proxy 407 noch nicht
